Revit 2024 API
BuiltInFailures.SiteFailures.CannotComputeProperArea Property
 Property Lines must close. Area will not be computed.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotComputeProperArea { get; }
Visual Basic
Public Shared ReadOnly Property CannotComputeProperArea As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotComputeProperArea {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace